I have tried hardoding the model as ``admin/controller`` in the terraform file.
This time the error message is different.

```
$ /snap/openstack/x7/bin/terraform apply -auto-approve -no-color -parallelism=1
data.juju_model.controller: Reading...
data.juju_model.controller: Read complete after 0s [id=8d0b2a70-18ca-44cb-8cde-16ca110434ec]
juju_application.microceph: Refreshing state... [id=controller:microceph]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # juju_offer.microceph_offer will be created
  + resource "juju_offer" "microceph_offer" {
      + application_name = "microceph"
      + endpoint         = "ceph"
      + id               = (known after apply)
      + model            = "admin/controller"
      + name             = (known after apply)
      + url              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
juju_offer.microceph_offer: Creating...

Error: "model-" is not a valid model tag

  with juju_offer.microceph_offer,
  on main.tf line 51, in resource "juju_offer" "microceph_offer":
  51: resource "juju_offer" "microceph_offer" {
```